Revit 2027 API
ViewSet.Erase Method
Removes a specified view from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	View item
)
Public Overridable Function Erase (
	item As View
) As Integer
public:
virtual int Erase(
	View^ item
)
abstract Erase :
        item : View -> int
override Erase :
        item : View -> int
Parameters
item View
The view to be erased.
Return Value
Int32
The number of views that were erased from the set.
See Also
Reference
ViewSet Class
Autodesk.Revit.DB Namespace